18) /home/samuelshenrique/projetos/alura/php/testes/integracao-phpunit/tests/Unit/Domain/LeilaoTest.php:57    [M] DecrementInteger

--- Original
+++ New
@@ @@
     {
         $usuario1 = new Usuario('Usuário 1');
         $usuario2 = new Usuario('Usuário 2');
-        return [[1, [new Lance($usuario1, 1000)]], [2, [new Lance($usuario1, 1000), new Lance($usuario2, 2000)]]];
+        return [[1, [new Lance($usuario1, 1000)]], [2, [new Lance($usuario1, 999), new Lance($usuario2, 2000)]]];
     }
 }

19) /home/samuelshenrique/projetos/alura/php/testes/integracao-phpunit/tests/Unit/Domain/LeilaoTest.php:57    [M] IncrementInteger

--- Original
+++ New
@@ @@
     {
         $usuario1 = new Usuario('Usuário 1');
         $usuario2 = new Usuario('Usuário 2');
-        return [[1, [new Lance($usuario1, 1000)]], [2, [new Lance($usuario1, 1000), new Lance($usuario2, 2000)]]];
+        return [[1, [new Lance($usuario1, 1000)]], [2, [new Lance($usuario1, 1001), new Lance($usuario2, 2000)]]];
     }
 }

20) /home/samuelshenrique/projetos/alura/php/testes/integracao-phpunit/tests/Unit/Domain/LeilaoTest.php:57    [M] DecrementInteger

--- Original
+++ New
@@ @@
     {
         $usuario1 = new Usuario('Usuário 1');
         $usuario2 = new Usuario('Usuário 2');
-        return [[1, [new Lance($usuario1, 1000)]], [2, [new Lance($usuario1, 1000), new Lance($usuario2, 2000)]]];
+        return [[1, [new Lance($usuario1, 1000)]], [2, [new Lance($usuario1, 1000), new Lance($usuario2, 1999)]]];
     }
 }

21) /home/samuelshenrique/projetos/alura/php/testes/integracao-phpunit/tests/Unit/Domain/LeilaoTest.php:57    [M] IncrementInteger

--- Original
+++ New
@@ @@
     {
         $usuario1 = new Usuario('Usuário 1');
         $usuario2 = new Usuario('Usuário 2');
-        return [[1, [new Lance($usuario1, 1000)]], [2, [new Lance($usuario1, 1000), new Lance($usuario2, 2000)]]];
+        return [[1, [new Lance($usuario1, 1000)]], [2, [new Lance($usuario1, 1000), new Lance($usuario2, 2001)]]];
     }
 }

22) /home/samuelshenrique/projetos/alura/php/testes/integracao-phpunit/tests/Unit/Domain/LeilaoTest.php:57    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     {
         $usuario1 = new Usuario('Usuário 1');
         $usuario2 = new Usuario('Usuário 2');
-        return [[1, [new Lance($usuario1, 1000)]], [2, [new Lance($usuario1, 1000), new Lance($usuario2, 2000)]]];
+        return [[1, [new Lance($usuario1, 1000)]], [2, [new Lance($usuario2, 2000)]]];
     }
 }

23) /home/samuelshenrique/projetos/alura/php/testes/integracao-phpunit/tests/Unit/Domain/LeilaoTest.php:57    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     {
         $usuario1 = new Usuario('Usuário 1');
         $usuario2 = new Usuario('Usuário 2');
-        return [[1, [new Lance($usuario1, 1000)]], [2, [new Lance($usuario1, 1000), new Lance($usuario2, 2000)]]];
+        return [[1, [new Lance($usuario1, 1000)]], [[new Lance($usuario1, 1000), new Lance($usuario2, 2000)]]];
     }
 }

24) /home/samuelshenrique/projetos/alura/php/testes/integracao-phpunit/tests/Unit/Service/AvaliadorTest.php:74    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $this->avaliador->avalia($leilao);
         static::assertCount(2, $this->avaliador->getTresMaioresLances());
     }
-    public static function leilaoComLancesEmOrdemCrescente()
+    protected static function leilaoComLancesEmOrdemCrescente()
     {
         $leilao = new Leilao('Fiat 147 0KM');
         $joao = new Usuario('João');

25) /home/samuelshenrique/projetos/alura/php/testes/integracao-phpunit/tests/Unit/Service/AvaliadorTest.php:81    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $joao = new Usuario('João');
         $maria = new Usuario('Maria');
         $ana = new Usuario('Ana');
-        $leilao->recebeLance(new Lance($joao, 1000));
+        $leilao->recebeLance(new Lance($joao, 999));
         $leilao->recebeLance(new Lance($maria, 1500));
         $leilao->recebeLance(new Lance($ana, 2000));
         return [[$leilao]];

26) /home/samuelshenrique/projetos/alura/php/testes/integracao-phpunit/tests/Unit/Service/AvaliadorTest.php:81    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $joao = new Usuario('João');
         $maria = new Usuario('Maria');
         $ana = new Usuario('Ana');
-        $leilao->recebeLance(new Lance($joao, 1000));
+        $leilao->recebeLance(new Lance($joao, 1001));
         $leilao->recebeLance(new Lance($maria, 1500));
         $leilao->recebeLance(new Lance($ana, 2000));
         return [[$leilao]];

27) /home/samuelshenrique/projetos/alura/php/testes/integracao-phpunit/tests/Unit/Service/AvaliadorTest.php:81    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $joao = new Usuario('João');
         $maria = new Usuario('Maria');
         $ana = new Usuario('Ana');
-        $leilao->recebeLance(new Lance($joao, 1000));
+        
         $leilao->recebeLance(new Lance($maria, 1500));
         $leilao->recebeLance(new Lance($ana, 2000));
         return [[$leilao]];

28) /home/samuelshenrique/projetos/alura/php/testes/integracao-phpunit/tests/Unit/Service/AvaliadorTest.php:82    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $maria = new Usuario('Maria');
         $ana = new Usuario('Ana');
         $leilao->recebeLance(new Lance($joao, 1000));
-        $leilao->recebeLance(new Lance($maria, 1500));
+        $leilao->recebeLance(new Lance($maria, 1499));
         $leilao->recebeLance(new Lance($ana, 2000));
         return [[$leilao]];
     }

29) /home/samuelshenrique/projetos/alura/php/testes/integracao-phpunit/tests/Unit/Service/AvaliadorTest.php:82    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $maria = new Usuario('Maria');
         $ana = new Usuario('Ana');
         $leilao->recebeLance(new Lance($joao, 1000));
-        $leilao->recebeLance(new Lance($maria, 1500));
+        $leilao->recebeLance(new Lance($maria, 1501));
         $leilao->recebeLance(new Lance($ana, 2000));
         return [[$leilao]];
     }

30) /home/samuelshenrique/projetos/alura/php/testes/integracao-phpunit/tests/Unit/Service/AvaliadorTest.php:82    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $maria = new Usuario('Maria');
         $ana = new Usuario('Ana');
         $leilao->recebeLance(new Lance($joao, 1000));
-        $leilao->recebeLance(new Lance($maria, 1500));
+        
         $leilao->recebeLance(new Lance($ana, 2000));
         return [[$leilao]];
     }

31) /home/samuelshenrique/projetos/alura/php/testes/integracao-phpunit/tests/Unit/Service/AvaliadorTest.php:83    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $ana = new Usuario('Ana');
         $leilao->recebeLance(new Lance($joao, 1000));
         $leilao->recebeLance(new Lance($maria, 1500));
-        $leilao->recebeLance(new Lance($ana, 2000));
+        $leilao->recebeLance(new Lance($ana, 1999));
         return [[$leilao]];
     }
     public static function leilaoComLancesEmOrdemDecrescente()

32) /home/samuelshenrique/projetos/alura/php/testes/integracao-phpunit/tests/Unit/Service/AvaliadorTest.php:83    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $ana = new Usuario('Ana');
         $leilao->recebeLance(new Lance($joao, 1000));
         $leilao->recebeLance(new Lance($maria, 1500));
-        $leilao->recebeLance(new Lance($ana, 2000));
+        $leilao->recebeLance(new Lance($ana, 2001));
         return [[$leilao]];
     }
     public static function leilaoComLancesEmOrdemDecrescente()

33) /home/samuelshenrique/projetos/alura/php/testes/integracao-phpunit/tests/Unit/Service/AvaliadorTest.php:83    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $ana = new Usuario('Ana');
         $leilao->recebeLance(new Lance($joao, 1000));
         $leilao->recebeLance(new Lance($maria, 1500));
-        $leilao->recebeLance(new Lance($ana, 2000));
+        
         return [[$leilao]];
     }
     public static function leilaoComLancesEmOrdemDecrescente()

34) /home/samuelshenrique/projetos/alura/php/testes/integracao-phpunit/tests/Unit/Service/AvaliadorTest.php:85    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $leilao->recebeLance(new Lance($joao, 1000));
         $leilao->recebeLance(new Lance($maria, 1500));
         $leilao->recebeLance(new Lance($ana, 2000));
-        return [[$leilao]];
+        return [];
     }
     public static function leilaoComLancesEmOrdemDecrescente()
     {

35) /home/samuelshenrique/projetos/alura/php/testes/integracao-phpunit/tests/Unit/Service/AvaliadorTest.php:86    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $leilao->recebeLance(new Lance($joao, 1000));
         $leilao->recebeLance(new Lance($maria, 1500));
         $leilao->recebeLance(new Lance($ana, 2000));
-        return [[$leilao]];
+        return [[]];
     }
     public static function leilaoComLancesEmOrdemDecrescente()
     {

36) /home/samuelshenrique/projetos/alura/php/testes/integracao-phpunit/tests/Unit/Service/AvaliadorTest.php:90    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $leilao->recebeLance(new Lance($ana, 2000));
         return [[$leilao]];
     }
-    public static function leilaoComLancesEmOrdemDecrescente()
+    protected static function leilaoComLancesEmOrdemDecrescente()
     {
         $leilao = new Leilao('Fiat 147 0KM');
         $joao = new Usuario('João');

37) /home/samuelshenrique/projetos/alura/php/testes/integracao-phpunit/tests/Unit/Service/AvaliadorTest.php:97    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $joao = new Usuario('João');
         $maria = new Usuario('Maria');
         $ana = new Usuario('Ana');
-        $leilao->recebeLance(new Lance($ana, 2000));
+        $leilao->recebeLance(new Lance($ana, 1999));
         $leilao->recebeLance(new Lance($maria, 1500));
         $leilao->recebeLance(new Lance($joao, 1000));
         return [[$leilao]];

38) /home/samuelshenrique/projetos/alura/php/testes/integracao-phpunit/tests/Unit/Service/AvaliadorTest.php:97    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $joao = new Usuario('João');
         $maria = new Usuario('Maria');
         $ana = new Usuario('Ana');
-        $leilao->recebeLance(new Lance($ana, 2000));
+        $leilao->recebeLance(new Lance($ana, 2001));
         $leilao->recebeLance(new Lance($maria, 1500));
         $leilao->recebeLance(new Lance($joao, 1000));
         return [[$leilao]];

39) /home/samuelshenrique/projetos/alura/php/testes/integracao-phpunit/tests/Unit/Service/AvaliadorTest.php:97    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $joao = new Usuario('João');
         $maria = new Usuario('Maria');
         $ana = new Usuario('Ana');
-        $leilao->recebeLance(new Lance($ana, 2000));
+        
         $leilao->recebeLance(new Lance($maria, 1500));
         $leilao->recebeLance(new Lance($joao, 1000));
         return [[$leilao]];

40) /home/samuelshenrique/projetos/alura/php/testes/integracao-phpunit/tests/Unit/Service/AvaliadorTest.php:98    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $maria = new Usuario('Maria');
         $ana = new Usuario('Ana');
         $leilao->recebeLance(new Lance($ana, 2000));
-        $leilao->recebeLance(new Lance($maria, 1500));
+        $leilao->recebeLance(new Lance($maria, 1499));
         $leilao->recebeLance(new Lance($joao, 1000));
         return [[$leilao]];
     }

41) /home/samuelshenrique/projetos/alura/php/testes/integracao-phpunit/tests/Unit/Service/AvaliadorTest.php:98    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $maria = new Usuario('Maria');
         $ana = new Usuario('Ana');
         $leilao->recebeLance(new Lance($ana, 2000));
-        $leilao->recebeLance(new Lance($maria, 1500));
+        $leilao->recebeLance(new Lance($maria, 1501));
         $leilao->recebeLance(new Lance($joao, 1000));
         return [[$leilao]];
     }

42) /home/samuelshenrique/projetos/alura/php/testes/integracao-phpunit/tests/Unit/Service/AvaliadorTest.php:98    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $maria = new Usuario('Maria');
         $ana = new Usuario('Ana');
         $leilao->recebeLance(new Lance($ana, 2000));
-        $leilao->recebeLance(new Lance($maria, 1500));
+        
         $leilao->recebeLance(new Lance($joao, 1000));
         return [[$leilao]];
     }

43) /home/samuelshenrique/projetos/alura/php/testes/integracao-phpunit/tests/Unit/Service/AvaliadorTest.php:99    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $ana = new Usuario('Ana');
         $leilao->recebeLance(new Lance($ana, 2000));
         $leilao->recebeLance(new Lance($maria, 1500));
-        $leilao->recebeLance(new Lance($joao, 1000));
+        $leilao->recebeLance(new Lance($joao, 999));
         return [[$leilao]];
     }
     public static function leilaoComLancesEmOrdemAleatoria()

44) /home/samuelshenrique/projetos/alura/php/testes/integracao-phpunit/tests/Unit/Service/AvaliadorTest.php:99    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $ana = new Usuario('Ana');
         $leilao->recebeLance(new Lance($ana, 2000));
         $leilao->recebeLance(new Lance($maria, 1500));
-        $leilao->recebeLance(new Lance($joao, 1000));
+        $leilao->recebeLance(new Lance($joao, 1001));
         return [[$leilao]];
     }
     public static function leilaoComLancesEmOrdemAleatoria()

45) /home/samuelshenrique/projetos/alura/php/testes/integracao-phpunit/tests/Unit/Service/AvaliadorTest.php:99    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $ana = new Usuario('Ana');
         $leilao->recebeLance(new Lance($ana, 2000));
         $leilao->recebeLance(new Lance($maria, 1500));
-        $leilao->recebeLance(new Lance($joao, 1000));
+        
         return [[$leilao]];
     }
     public static function leilaoComLancesEmOrdemAleatoria()

46) /home/samuelshenrique/projetos/alura/php/testes/integracao-phpunit/tests/Unit/Service/AvaliadorTest.php:101    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $leilao->recebeLance(new Lance($ana, 2000));
         $leilao->recebeLance(new Lance($maria, 1500));
         $leilao->recebeLance(new Lance($joao, 1000));
-        return [[$leilao]];
+        return [];
     }
     public static function leilaoComLancesEmOrdemAleatoria()
     {

47) /home/samuelshenrique/projetos/alura/php/testes/integracao-phpunit/tests/Unit/Service/AvaliadorTest.php:102    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $leilao->recebeLance(new Lance($ana, 2000));
         $leilao->recebeLance(new Lance($maria, 1500));
         $leilao->recebeLance(new Lance($joao, 1000));
-        return [[$leilao]];
+        return [[]];
     }
     public static function leilaoComLancesEmOrdemAleatoria()
     {

48) /home/samuelshenrique/projetos/alura/php/testes/integracao-phpunit/tests/Unit/Service/AvaliadorTest.php:106    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $leilao->recebeLance(new Lance($joao, 1000));
         return [[$leilao]];
     }
-    public static function leilaoComLancesEmOrdemAleatoria()
+    protected static function leilaoComLancesEmOrdemAleatoria()
     {
         $leilao = new Leilao('Fiat 147 0KM');
         $joao = new Usuario('João');

49) /home/samuelshenrique/projetos/alura/php/testes/integracao-phpunit/tests/Unit/Service/AvaliadorTest.php:113    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $joao = new Usuario('João');
         $maria = new Usuario('Maria');
         $ana = new Usuario('Ana');
-        $leilao->recebeLance(new Lance($maria, 1500));
+        $leilao->recebeLance(new Lance($maria, 1499));
         $leilao->recebeLance(new Lance($ana, 2000));
         $leilao->recebeLance(new Lance($joao, 1000));
         return [[$leilao]];
     }
 }

50) /home/samuelshenrique/projetos/alura/php/testes/integracao-phpunit/tests/Unit/Service/AvaliadorTest.php:113    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $joao = new Usuario('João');
         $maria = new Usuario('Maria');
         $ana = new Usuario('Ana');
-        $leilao->recebeLance(new Lance($maria, 1500));
+        $leilao->recebeLance(new Lance($maria, 1501));
         $leilao->recebeLance(new Lance($ana, 2000));
         $leilao->recebeLance(new Lance($joao, 1000));
         return [[$leilao]];
     }
 }

51) /home/samuelshenrique/projetos/alura/php/testes/integracao-phpunit/tests/Unit/Service/AvaliadorTest.php:113    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $joao = new Usuario('João');
         $maria = new Usuario('Maria');
         $ana = new Usuario('Ana');
-        $leilao->recebeLance(new Lance($maria, 1500));
+        
         $leilao->recebeLance(new Lance($ana, 2000));
         $leilao->recebeLance(new Lance($joao, 1000));
         return [[$leilao]];
     }
 }

55) /home/samuelshenrique/projetos/alura/php/testes/integracao-phpunit/tests/Unit/Service/AvaliadorTest.php:115    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $ana = new Usuario('Ana');
         $leilao->recebeLance(new Lance($maria, 1500));
         $leilao->recebeLance(new Lance($ana, 2000));
-        $leilao->recebeLance(new Lance($joao, 1000));
+        $leilao->recebeLance(new Lance($joao, 999));
         return [[$leilao]];
     }
 }

56) /home/samuelshenrique/projetos/alura/php/testes/integracao-phpunit/tests/Unit/Service/AvaliadorTest.php:115    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $ana = new Usuario('Ana');
         $leilao->recebeLance(new Lance($maria, 1500));
         $leilao->recebeLance(new Lance($ana, 2000));
-        $leilao->recebeLance(new Lance($joao, 1000));
+        $leilao->recebeLance(new Lance($joao, 1001));
         return [[$leilao]];
     }
 }

57) /home/samuelshenrique/projetos/alura/php/testes/integracao-phpunit/tests/Unit/Service/AvaliadorTest.php:115    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $ana = new Usuario('Ana');
         $leilao->recebeLance(new Lance($maria, 1500));
         $leilao->recebeLance(new Lance($ana, 2000));
-        $leilao->recebeLance(new Lance($joao, 1000));
+        
         return [[$leilao]];
     }
 }
